experiments/workflow/boki-movie/expected_results/qps150/wrk.log
Running 2m test @ http://ip-172-31-6-74.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 3.575ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.27ms    6.49ms  47.52ms   95.67%
    Req/Sec    77.96     56.92   500.00     71.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.24ms
 90.000%    1.39ms
 99.000%   43.52ms
 99.900%   47.52ms
 99.990%   47.55ms
 99.999%   47.55ms
100.000%   47.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.238     0.000000            1         1.00
       0.523     0.100000         2103         1.11
       0.635     0.200000         4202         1.25
       0.741     0.300000         6311         1.43
       0.841     0.400000         8415         1.67
       0.952     0.500000        10505         2.00
       1.011     0.550000        11559         2.22
       1.068     0.600000        12622         2.50
       1.120     0.650000        13663         2.86
       1.176     0.700000        14704         3.33
       1.236     0.750000        15762         4.00
       1.259     0.775000        16275         4.44
       1.286     0.800000        16818         5.00
       1.309     0.825000        17327         5.71
       1.336     0.850000        17862         6.67
       1.360     0.875000        18378         8.00
       1.374     0.887500        18648         8.89
       1.390     0.900000        18912        10.00
       1.412     0.912500        19166        11.43
       1.436     0.925000        19430        13.33
       1.477     0.937500        19689        16.00
       4.207     0.943750        19820        17.78
       4.251     0.950000        19955        20.00
       8.247     0.956250        20083        22.86
      17.359     0.962500        20226        26.67
      17.407     0.968750        20344        32.00
      30.399     0.971875        20420        35.56
      30.431     0.975000        20519        40.00
      30.447     0.978125        20545        45.71
      30.511     0.981250        20622        53.33
      34.399     0.984375        20675        64.00
      43.519     0.985938        20913        71.11
      43.519     0.987500        20913        80.00
      43.519     0.989062        20913        91.43
      43.519     0.990625        20913       106.67
      43.519     0.992188        20913       128.00
      43.519     0.992969        20913       142.22
      43.519     0.993750        20913       160.00
      43.519     0.994531        20913       182.86
      43.519     0.995313        20913       213.33
      43.551     0.996094        20968       256.00
      43.551     0.996484        20968       284.44
      43.551     0.996875        20968       320.00
      43.551     0.997266        20968       365.71
      43.551     0.997656        20968       426.67
      43.551     0.998047        20968       512.00
      43.551     0.998242        20968       568.89
      43.551     0.998437        20968       640.00
      44.863     0.998633        20972       731.43
      47.519     0.998828        20987       853.33
      47.519     0.999023        20987      1024.00
      47.519     0.999121        20987      1137.78
      47.519     0.999219        20987      1280.00
      47.519     0.999316        20987      1462.86
      47.551     0.999414        21000      1706.67
      47.551     1.000000        21000          inf
#[Mean    =        2.274, StdDeviation   =        6.487]
#[Max     =       47.520, Total count    =        21000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  191.00us
 75.000%  206.00us
 90.000%  226.00us
 99.000%   42.75ms
 99.900%   46.69ms
 99.990%   46.88ms
 99.999%   46.91ms
100.000%   46.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.130     0.000000            2         1.00
       0.171     0.100000         2217         1.11
       0.177     0.200000         4305         1.25
       0.182     0.300000         6693         1.43
       0.186     0.400000         8613         1.67
       0.191     0.500000        10914         2.00
       0.193     0.550000        11751         2.22
       0.196     0.600000        12972         2.50
       0.198     0.650000        13722         2.86
       0.202     0.700000        14930         3.33
       0.206     0.750000        15949         4.00
       0.208     0.775000        16378         4.44
       0.210     0.800000        16804         5.00
       0.214     0.825000        17447         5.71
       0.217     0.850000        17906         6.67
       0.221     0.875000        18420         8.00
       0.224     0.887500        18740         8.89
       0.226     0.900000        18966        10.00
       0.229     0.912500        19215        11.43
       0.232     0.925000        19443        13.33
       0.236     0.937500        19711        16.00
       0.238     0.943750        19824        17.78
       0.241     0.950000        19986        20.00
       0.243     0.956250        20083        22.86
       0.247     0.962500        20228        26.67
       0.252     0.968750        20358        32.00
       0.255     0.971875        20424        35.56
       0.259     0.975000        20486        40.00
       0.265     0.978125        20546        45.71
       0.273     0.981250        20608        53.33
       0.302     0.984375        20672        64.00
      42.591     0.985938        20705        71.11
      42.687     0.987500        20743        80.00
      42.719     0.989062        20772        91.43
      42.751     0.990625        20827       106.67
      42.783     0.992188        20872       128.00
      42.783     0.992969        20872       142.22
      42.783     0.993750        20872       160.00
      42.815     0.994531        20905       182.86
      42.815     0.995313        20905       213.33
      42.847     0.996094        20930       256.00
      42.847     0.996484        20930       284.44
      42.879     0.996875        20952       320.00
      42.879     0.997266        20952       365.71
      42.879     0.997656        20952       426.67
      42.911     0.998047        20968       512.00
      42.911     0.998242        20968       568.89
      42.911     0.998437        20968       640.00
      43.935     0.998633        20972       731.43
      46.623     0.998828        20977       853.33
      46.687     0.999023        20981      1024.00
      46.719     0.999121        20983      1137.78
      46.751     0.999219        20987      1280.00
      46.751     0.999316        20987      1462.86
      46.783     0.999414        20992      1706.67
      46.783     0.999512        20992      2048.00
      46.783     0.999561        20992      2275.56
      46.783     0.999609        20992      2560.00
      46.815     0.999658        20997      2925.71
      46.815     0.999707        20997      3413.33
      46.815     0.999756        20997      4096.00
      46.815     0.999780        20997      4551.11
      46.815     0.999805        20997      5120.00
      46.815     0.999829        20997      5851.43
      46.815     0.999854        20997      6826.67
      46.879     0.999878        20998      8192.00
      46.879     0.999890        20998      9102.22
      46.879     0.999902        20998     10240.00
      46.911     0.999915        21000     11702.86
      46.911     1.000000        21000          inf
#[Mean    =        0.816, StdDeviation   =        5.121]
#[Max     =       46.880, Total count    =        21000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22502 requests in 2.50m, 3.50MB read
Requests/sec:    150.01
Transfer/sec:     23.88KB