experiments/workflow/boki-movie/expected_results/qps150/wrk_warmup.log
Running 30s test @ http://ip-172-31-6-74.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 1.936ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.168ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.54ms    8.84ms  47.94ms   91.59%
    Req/Sec    77.72     66.20   500.00     66.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.00ms
 75.000%    1.26ms
 90.000%    4.26ms
 99.000%   43.94ms
 99.900%   44.03ms
 99.990%   47.97ms
 99.999%   47.97ms
100.000%   47.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.254     0.000000            1         1.00
       0.527     0.100000          300         1.11
       0.655     0.200000          600         1.25
       0.768     0.300000          901         1.43
       0.881     0.400000         1200         1.67
       1.003     0.500000         1500         2.00
       1.063     0.550000         1653         2.22
       1.114     0.600000         1803         2.50
       1.168     0.650000         1951         2.86
       1.217     0.700000         2101         3.33
       1.265     0.750000         2252         4.00
       1.284     0.775000         2325         4.44
       1.307     0.800000         2402         5.00
       1.339     0.825000         2474         5.71
       1.372     0.850000         2552         6.67
       1.430     0.875000         2624         8.00
       2.745     0.887500         2661         8.89
       4.255     0.900000         2700        10.00
       4.675     0.912500         2736        11.43
      17.279     0.925000         2776        13.33
      17.791     0.937500         2814        16.00
      21.791     0.943750         2830        17.78
      30.351     0.950000         2851        20.00
      30.463     0.956250         2867        22.86
      30.847     0.962500         2888        26.67
      30.927     0.968750         2905        32.00
      34.943     0.971875         2914        35.56
      43.423     0.975000         2948        40.00
      43.423     0.978125         2948        45.71
      43.423     0.981250         2948        53.33
      43.487     0.984375         2952        64.00
      43.935     0.985938         2979        71.11
      43.935     0.987500         2979        80.00
      43.935     0.989062         2979        91.43
      43.935     0.990625         2979       106.67
      43.935     0.992188         2979       128.00
      43.935     0.992969         2979       142.22
      43.967     0.993750         2991       160.00
      43.967     0.994531         2991       182.86
      43.967     0.995313         2991       213.33
      43.967     0.996094         2991       256.00
      43.967     0.996484         2991       284.44
      43.967     0.996875         2991       320.00
      43.967     0.997266         2991       365.71
      43.967     0.997656         2991       426.67
      43.999     0.998047         2994       512.00
      43.999     0.998242         2994       568.89
      43.999     0.998437         2994       640.00
      43.999     0.998633         2994       731.43
      44.031     0.998828         2995       853.33
      47.935     0.999023         2996      1024.00
      47.935     0.999121         2996      1137.78
      47.935     0.999219         2996      1280.00
      47.935     0.999316         2996      1462.86
      47.967     0.999414         2998      1706.67
      47.967     1.000000         2998          inf
#[Mean    =        3.537, StdDeviation   =        8.836]
#[Max     =       47.936, Total count    =         2998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  185.00us
 75.000%  203.00us
 90.000%  229.00us
 99.000%   42.85ms
 99.900%   43.74ms
 99.990%   46.91ms
 99.999%   46.91ms
100.000%   46.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.130     0.000000            1         1.00
       0.164     0.100000          318         1.11
       0.172     0.200000          645         1.25
       0.176     0.300000          906         1.43
       0.180     0.400000         1220         1.67
       0.185     0.500000         1564         2.00
       0.187     0.550000         1660         2.22
       0.190     0.600000         1808         2.50
       0.194     0.650000         1985         2.86
       0.198     0.700000         2105         3.33
       0.203     0.750000         2263         4.00
       0.206     0.775000         2334         4.44
       0.209     0.800000         2403         5.00
       0.213     0.825000         2476         5.71
       0.218     0.850000         2560         6.67
       0.223     0.875000         2624         8.00
       0.226     0.887500         2668         8.89
       0.229     0.900000         2706        10.00
       0.232     0.912500         2737        11.43
       0.237     0.925000         2781        13.33
       0.243     0.937500         2813        16.00
       0.248     0.943750         2834        17.78
       0.252     0.950000         2850        20.00
       0.256     0.956250         2867        22.86
       0.266     0.962500         2887        26.67
       0.286     0.968750         2905        32.00
       3.945     0.971875         2914        35.56
      42.719     0.975000         2925        40.00
      42.783     0.978125         2948        45.71
      42.783     0.981250         2948        53.33
      42.815     0.984375         2964        64.00
      42.815     0.985938         2964        71.11
      42.815     0.987500         2964        80.00
      42.847     0.989062         2973        91.43
      42.847     0.990625         2973       106.67
      42.879     0.992188         2984       128.00
      42.879     0.992969         2984       142.22
      42.879     0.993750         2984       160.00
      42.879     0.994531         2984       182.86
      42.879     0.995313         2984       213.33
      43.615     0.996094         2988       256.00
      43.615     0.996484         2988       284.44
      43.647     0.996875         2989       320.00
      43.679     0.997266         2991       365.71
      43.679     0.997656         2991       426.67
      43.743     0.998047         2995       512.00
      43.743     0.998242         2995       568.89
      43.743     0.998437         2995       640.00
      43.743     0.998633         2995       731.43
      43.743     0.998828         2995       853.33
      46.719     0.999023         2996      1024.00
      46.719     0.999121         2996      1137.78
      46.719     0.999219         2996      1280.00
      46.719     0.999316         2996      1462.86
      46.879     0.999414         2997      1706.67
      46.879     0.999512         2997      2048.00
      46.879     0.999561         2997      2275.56
      46.879     0.999609         2997      2560.00
      46.879     0.999658         2997      2925.71
      46.911     0.999707         2998      3413.33
      46.911     1.000000         2998          inf
#[Mean    =        1.391, StdDeviation   =        7.067]
#[Max     =       46.880, Total count    =         2998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4502 requests in 30.00s, 716.63KB read
Requests/sec:    150.06
Transfer/sec:     23.89KB